k = int(input('День тижня:'))
r = {
    1:['2 математика','3 історія україни','4 іноземна мова','5 ф-ра'],
    2:['2 технології','3 укр мова','4 ппз/лін. алгебра','5 класна година'],
    3:['2 ппз(1підгр)','3 технології (1підгр)','4 укр. літ/ фізика','5 ппз (2підгр)','6 технології (2підгр)'],
    4:['1 технології (1підгр)','2 іноземна мова','3 укр. літ.','4 фіз-ра/ математика','5 технології (2підгр)'],
    5:['1 екологія','2 лін. алгебра','3 фізика','4 - / технології']
}
if k >= 1 and k <= 5:
    print('\n'.join(r[k]))
else:
    print('Error')
